In [ ]:
Storage Engines
=================================

mysql> show engines;
+--------------------+---------+----------------------------------------------------------------+--------------+------+------------+
| Engine             | Support | Comment                                                        | Transactions | XA   | Savepoints |
+--------------------+---------+----------------------------------------------------------------+--------------+------+------------+
| FEDERATED          | NO      | Federated MySQL storage engine                                 | NULL         | NULL | NULL       |
| MEMORY             | YES     | Hash based, stored in memory, useful for temporary tables      | NO           | NO   | NO         |
| InnoDB             | DEFAULT | Supports transactions, row-level locking, and foreign keys     | YES          | YES  | YES        |
| PERFORMANCE_SCHEMA | YES     | Performance Schema                                             | NO           | NO   | NO         |
| MyISAM             | YES     | MyISAM storage engine                                          | NO           | NO   | NO         |
| MRG_MYISAM         | YES     | Collection of identical MyISAM tables                          | NO           | NO   | NO         |
| BLACKHOLE          | YES     | /dev/null storage engine (anything you write to it disappears) | NO           | NO   | NO         |
| CSV                | YES     | CSV storage engine                                             | NO           | NO   | NO         |
| ARCHIVE            | YES     | Archive storage engine                                         | NO           | NO   | NO         |
+--------------------+---------+----------------------------------------------------------------+--------------+------+------------+
9 rows

In [ ]:
Federated Storage Engine 
===================================

-- is used to create a table in one server that will point to a table in another mysql server.
-- this is similar to MS SqlServer linked server and orale database link.
-- the source and target table should have same column name , target can also be subset of source table.
-- the source table can be of any storage engine but the target/requestor table should be FEDRERATED engine.
-- this is disabled by default.


Enable Federated storage engine in Requestor server ( MySqlServer2 )
============================================================================

mysql> show engines;
+--------------------+---------+
| Engine             | Support |
+--------------------+---------+
| FEDERATED          | NO      |
| MEMORY             | YES     |
| InnoDB             | DEFAULT |

[root@MySqlServer2 plugin]# vi /etc/my.cnf
[root@MySqlServer2 plugin]# 
[root@MySqlServer2 plugin]# cat /etc/my.cnf | grep fed
federated
[root@MySqlServer2 plugin]# 
[root@MySqlServer2 plugin]# systemctl restart mysqld
[root@MySqlServer2 plugin]# 
[root@MySqlServer2 plugin]# mysqladmin ping
mysqld is alive
[root@MySqlServer2 plugin]# 

mysql> select engine , support , comment from information_schema.engines where engine like '%fed%';
+-----------+---------+--------------------------------+
| engine    | support | comment                        |
+-----------+---------+--------------------------------+
| FEDERATED | YES     | Federated MySQL storage engine |
+-----------+---------+--------------------------------+
1 row in set (0.00 sec)


In Source server create user for use in the link and create a table ( MySqlServer )
=========================================================================================

mysql> create table employee_details (
    -> emp_id int primary key,
    -> emp_name varchar(100),
    -> emp_dob date,
    -> emp_email varchar(100)
    -> );

mysql> insert into employee_details values
    -> (1001 , 'vsdsad' , now() , 'dsadad@ggf.com'),
    -> (1002 , 'hfhgg' , now() , 'frjhgfhgjfg@sjhgfsdgf.com'),
    -> (1003 , 'yrhjrr' , now() , 'urrjkgg@fgdfhg.com');
Query OK, 3 rows affected, 3 warnings (0.01 sec)
Records: 3  Duplicates: 0  Warnings: 3

mysql> create user 'link_user'@'%' identified by 'Link!2024';
Query OK, 0 rows affected (0.16 sec)

mysql> grant select on posdb.* to 'link_user'@'%';
Query OK, 0 rows affected (0.01 sec)


Create a table in requestor server ( MySqlServer2 ) and link to the source table 
=====================================================================================

create table employee_details (
emp_id int primary key,
emp_name varchar(100),
emp_dob date,
emp_email varchar(100)
) engine = federated
connection = 'mysql://link_user:Link!2024@192.168.153.133:3306/posdb/employee_details'

Query OK, 0 rows affected (0.00 sec)

mysql> select @@hostname;
+--------------+
| @@hostname   |
+--------------+
| MySqlServer2 |
+--------------+
1 row in set (0.01 sec)

mysql> select * from employee_details;
+--------+----------+------------+---------------------------+
| emp_id | emp_name | emp_dob    | emp_email                 |
+--------+----------+------------+---------------------------+
|   1001 | vsdsad   | 2024-05-17 | dsadad@ggf.com            |
|   1002 | hfhgg    | 2024-05-17 | frjhgfhgjfg@sjhgfsdgf.com |
|   1003 | yrhjrr   | 2024-05-17 | urrjkgg@fgdfhg.com        |
+--------+----------+------------+---------------------------+
3 rows in set (0.01 sec)


mysql> select table_name , table_type , engine , table_rows from information_schema.tables 
where table_schema = 'stageposdb';
+------------------+------------+-----------+------------+
| TABLE_NAME       | TABLE_TYPE | ENGINE    | TABLE_ROWS |
+------------------+------------+-----------+------------+
| employee_details | BASE TABLE | FEDERATED |          3 |
+------------------+------------+-----------+------------+
1 row in set (0.00 sec)

mysql> select @@hostname;
+--------------+
| @@hostname   |
+--------------+
| MySqlServer2 |
+--------------+
1 row in set (0.00 sec)

mysql> insert into employee_details values ( 1004 , 'jhhagd' , now() , 'jhgdjfdf@yrwer.com' );
ERROR 1296 (HY000): Got error 10000 'Error on remote system: 1142: INSERT command denied 
to user 'link_user'@'192.168.153.134' for table ' from FEDERATED
mysql> 

mysql> select @@hostname;
+-------------+
| @@hostname  |
+-------------+
| mysqlserver |
+-------------+
1 row in set (0.20 sec)

mysql> grant insert on posdb.* to 'link_user'@'%';
Query OK, 0 rows affected (0.01 sec)

mysql> select @@hostname;
+--------------+
| @@hostname   |
+--------------+
| MySqlServer2 |
+--------------+
1 row in set (0.00 sec)

mysql> insert into employee_details values ( 1004 , 'jhhagd' , now() , 'jhgdjfdf@yrwer.com' );
ERROR 1296 (HY000): Got error 10000 'Error on remote system: 1142: INSERT command denied to 
user 'link_user'@'192.168.153.134' for table ' from FEDERATED

mysql> update employee_details set emp_name = 'Ranga' where emp_id = 1001;
ERROR 1296 (HY000): Got error 10000 'Error on remote system: 1142: UPDATE command denied to 
user 'link_user'@'192.168.153.134' for table ' from FEDERATED
mysql> 


create table with different name than the source table 
=================================================================

mysql> create table emp_details_federated (
    -> emp_id int primary key,
    -> emp_name varchar(100),
    -> emp_dob date,
    -> emp_email varchar(100)
    -> ) engine = federated
    -> connection = 'mysql://link_user:Link!2024@192.168.153.133:3306/posdb/employee_details';
Query OK, 0 rows affected (0.00 sec)

mysql> select * from emp_details_federated;
+--------+----------+------------+---------------------------+
| emp_id | emp_name | emp_dob    | emp_email                 |
+--------+----------+------------+---------------------------+
|   1001 | vsdsad   | 2024-05-17 | dsadad@ggf.com            |
|   1002 | hfhgg    | 2024-05-17 | frjhgfhgjfg@sjhgfsdgf.com |
|   1003 | yrhjrr   | 2024-05-17 | urrjkgg@fgdfhg.com        |
+--------+----------+------------+---------------------------+
3 rows in set (0.08 sec)


create table with subset of columns from source table 
===================================================================

mysql> create table emp_details_idname_federated (
    -> emp_id int primary key,
    -> emp_name varchar(100)
    -> ) engine = federated
    -> connection = 'mysql://link_user:Link!2024@192.168.153.133:3306/posdb/employee_details';
Query OK, 0 rows affected (0.02 sec)

mysql> select * from emp_details_idname_federated;
+--------+----------+
| emp_id | emp_name |
+--------+----------+
|   1001 | vsdsad   |
|   1002 | hfhgg    |
|   1003 | yrhjrr   |
+--------+----------+
3 rows in set (0.29 sec)


create table with different column name than source table column 
=====================================================================

mysql> create table emp_details_updt_federated (
    -> employee_id int primary key,
    -> employee_name varchar(100)
    -> ) engine = federated
    -> connection = 'mysql://link_user:Link!2024@192.168.153.133:3306/posdb/employee_details';
Query OK, 0 rows affected (0.00 sec)

mysql> select * from emp_details_updt_federated;
ERROR 1431 (HY000): The foreign data source you are trying to reference does not exist. Data source error:  error: 1054  'Unknown column 'employee_id' in 'field list''
mysql> 


create table without primary key in requestor server 
==========================================================

mysql> create table emp_details_updt_federated (
    -> emp_id int,
    -> emp_name varchar(100)
    -> ) engine = federated
    -> connection = 'mysql://link_user:Link!2024@192.168.153.133:3306/posdb/employee_details';
Query OK, 0 rows affected (0.00 sec)

mysql> select * from emp_details_updt_federated;
+--------+----------+
| emp_id | emp_name |
+--------+----------+
|   1001 | vsdsad   |
|   1002 | hfhgg    |
|   1003 | yrhjrr   |
+--------+----------+
3 rows in set (0.07 sec)


Insert data in the source table and check in target table 
=========================================================================

mysql> select @@hostname;
+-------------+
| @@hostname  |
+-------------+
| mysqlserver |
+-------------+

mysql> insert into employee_details values 
( 1004 , 'Ranga' , now() , 'Ranga@hdff.com' ), 
( 1005 , 'Changa' , now() , 'Changa@dvs.com' ), 
( 1006 , 'Sunga' , now() , 'Sunga@rewer.com' );

Query OK, 3 rows affected, 3 warnings (0.16 sec)
Records: 3  Duplicates: 0  Warnings: 3

mysql> select @@hostname;
+--------------+
| @@hostname   |
+--------------+
| MySqlServer2 |
+--------------+
1 row in set (0.00 sec)

mysql> select table_name , table_type , engine , table_rows from information_schema.tables 
where table_schema = 'stageposdb';
+------------------------------+------------+-----------+------------+
| TABLE_NAME                   | TABLE_TYPE | ENGINE    | TABLE_ROWS |
+------------------------------+------------+-----------+------------+
| emp_details_federated        | BASE TABLE | FEDERATED |          3 |
| emp_details_idname_federated | BASE TABLE | FEDERATED |          3 |
| emp_details_updt_federated   | BASE TABLE | FEDERATED |          3 |
| employee_details             | BASE TABLE | FEDERATED |          3 |
+------------------------------+------------+-----------+------------+

mysql> select * from employee_details;
+--------+----------+------------+---------------------------+
| emp_id | emp_name | emp_dob    | emp_email                 |
+--------+----------+------------+---------------------------+
|   1001 | vsdsad   | 2024-05-17 | dsadad@ggf.com            |
|   1002 | hfhgg    | 2024-05-17 | frjhgfhgjfg@sjhgfsdgf.com |
|   1003 | yrhjrr   | 2024-05-17 | urrjkgg@fgdfhg.com        |
|   1004 | Ranga    | 2024-05-17 | Ranga@hdff.com            |
|   1005 | Changa   | 2024-05-17 | Changa@dvs.com            |
|   1006 | Sunga    | 2024-05-17 | Sunga@rewer.com           |
+--------+----------+------------+---------------------------+
6 rows in set (0.00 sec)

mysql> select * from emp_details_idname_federated;
+--------+----------+
| emp_id | emp_name |
+--------+----------+
|   1001 | vsdsad   |
|   1002 | hfhgg    |
|   1003 | yrhjrr   |
|   1004 | Ranga    |
|   1005 | Changa   |
|   1006 | Sunga    |
+--------+----------+
6 rows in set (0.01 sec)

In [ ]:
BlackHole Storage Engine
====================================

-- acts like a black hole , anything goes insides never comes back.
-- it is just like /dev/null in linux.


mysql> create table employee_salaries (
    -> emp_id int primary key,
    -> emp_salary numeric(6,2)
    -> ) engine = blackhole;
Query OK, 0 rows affected (0.05 sec)

mysql> insert into employee_salaries values ( 1001 , 3456.50 ) , ( 1002 , 5400.00 ) , ( 1003 , 4300.00);
Query OK, 3 rows affected (0.10 sec)
Records: 3  Duplicates: 0  Warnings: 0

mysql> select * from employee_salaries;
Empty set (0.00 sec)

mysql> create index idx_empsal_emp_sal on employee_salaries(emp_salary);
Query OK, 0 rows affected (0.09 sec)
Records: 0  Duplicates: 0  Warnings: 0

mysql> update employee_salaries set emp_salary = 4200.00 where emp_id = 1001;
Query OK, 0 rows affected, 1 warning (0.01 sec)
Rows matched: 0  Changed: 0  Warnings: 1

mysql> delete from employee_salaries where emp_id = 1002;
Query OK, 0 rows affected, 1 warning (0.00 sec)

mysql> insert into employee_salaries values ( 1001 , 3456.50 ) , ( 1002 , 5400.00 ) , ( 1003 , 4300.00);
Query OK, 3 rows affected (0.00 sec)
Records: 3  Duplicates: 0  Warnings: 0

[root@mysqlserver posdb]# pwd
/var/lib/mysql/posdb
[root@mysqlserver posdb]# ls -rtl *employee_sal*
-rw-r-----. 1 mysql mysql 3175 May 17 14:08 employee_salarie_387.sdi
[root@mysqlserver posdb]#

In [ ]:
Memory Storage Engine 
==========================================

-- data is stored in memory instead of disk hence fast retreival.
-- not persistent , data will be lost on server restart.
-- usefull for temporary tables.

mysql> create table emp_details (
    -> emp_id int primary key,
    -> emp_name varchar(50)
    -> ) engine = memory;
Query OK, 0 rows affected (0.40 sec)

mysql> insert into emp_details values ( 1001 , 'Ranga' ) , ( 1002 , 'Manga' );
Query OK, 2 rows affected (0.01 sec)
Records: 2  Duplicates: 0  Warnings: 0

mysql> select table_name , table_type , engine from information_schema.tables where table_schema = 'posdb';
+-------------------+------------+-----------+
| TABLE_NAME        | TABLE_TYPE | ENGINE    |
+-------------------+------------+-----------+
| emp_details       | BASE TABLE | MEMORY    |
| employee_details  | BASE TABLE | InnoDB    |
| employee_salaries | BASE TABLE | BLACKHOLE |
+-------------------+------------+-----------+
3 rows in set (0.00 sec)

mysql> create index idx_emp_details_empname on emp_details ( emp_name );
Query OK, 2 rows affected (0.10 sec)
Records: 2  Duplicates: 0  Warnings: 0

mysql> start transaction ;
Query OK, 0 rows affected (0.00 sec)

mysql> insert into emp_details values ( 1003 , 'Changa');
Query OK, 1 row affected (0.01 sec)

mysql> rollback;
Query OK, 0 rows affected, 1 warning (0.00 sec)

mysql> show warnings;
+---------+------+---------------------------------------------------------------+
| Level   | Code | Message                                                       |
+---------+------+---------------------------------------------------------------+
| Warning | 1196 | Some non-transactional changed tables couldn't be rolled back |
+---------+------+---------------------------------------------------------------+
1 row in set (0.00 sec)

mysql> select * from emp_details;
+--------+----------+
| emp_id | emp_name |
+--------+----------+
|   1001 | Ranga    |
|   1002 | Manga    |
|   1003 | Changa   |
+--------+----------+
3 rows in set (0.00 sec)


[root@mysqlserver ~]# systemctl restart mysqld
[root@mysqlserver ~]# 

[root@mysqlserver ~]# mysql
Welcome to the MySQL monitor.  Commands end with ; or \g.

mysql> use posdb;

Database changed

mysql> select table_name , table_type , engine from information_schema.tables where table_schema = 'posdb';
+-------------------+------------+-----------+
| TABLE_NAME        | TABLE_TYPE | ENGINE    |
+-------------------+------------+-----------+
| emp_details       | BASE TABLE | MEMORY    |
| employee_details  | BASE TABLE | InnoDB    |
| employee_salaries | BASE TABLE | BLACKHOLE |
+-------------------+------------+-----------+

mysql> select * from emp_details;
Empty set (0.00 sec)


[root@mysqlserver posdb]# pwd
/var/lib/mysql/posdb
[root@mysqlserver posdb]# ls -rtl *emp_det*
-rw-r-----. 1 mysql mysql 3167 May 17 17:09 emp_details_391.sdi
[root@mysqlserver posdb]#

In [ ]:
CSV storage engine 
==============================

-- stores table in text format with commas seperated values.
-- can be read and written by spreadsheet applications like excel.
-- does not support transactions and index.


mysql> create table employees (
    -> emp_id int primary key,
    -> emp_name varchar(100),
    -> emp_dob date
    -> ) engine = csv;
ERROR 1069 (42000): Too many keys specified; max 0 keys allowed


mysql> create table employees (
    -> emp_id int ,
    -> emp_name varchar(100),
    -> emp_dob date
    -> ) engine = csv;
ERROR 1178 (42000): The storage engine for the table doesn't support nullable columns


mysql> create table employees (
    -> emp_id int not null,
    -> emp_name varchar(100) not null,
    -> emp_dob date not null
    -> ) engine = csv;

Query OK, 0 rows affected (0.08 sec)


mysql> insert into employees values 
    -> (1001 , 'Ranga' , now() ),
    -> (1002 , 'Manga' , now() ),
    -> (1003 , 'Changa' , now() );
Query OK, 3 rows affected, 3 warnings (0.00 sec)
Records: 3  Duplicates: 0  Warnings: 3


mysql> select * from employees;
+--------+----------+------------+
| emp_id | emp_name | emp_dob    |
+--------+----------+------------+
|   1001 | Ranga    | 2024-05-17 |
|   1002 | Manga    | 2024-05-17 |
|   1003 | Changa   | 2024-05-17 |
+--------+----------+------------+
3 rows in set (0.00 sec)


[root@mysqlserver posdb]# ls -rtl *employees*
-rw-r-----. 1 mysql mysql 3752 May 17 23:08 employees_394.sdi
-rw-r-----. 1 mysql mysql   35 May 17 23:09 employees.CSM
-rw-r-----. 1 mysql mysql   79 May 17 23:09 employees.CSV
[root@mysqlserver posdb]# 


[root@mysqlserver posdb]# cat employees.CSV
1001,"Ranga","2024-05-17"
1002,"Manga","2024-05-17"
1003,"Changa","2024-05-17"
[root@mysqlserver posdb]# 

[root@mysqlserver posdb]# vi employees.CSV
[root@mysqlserver posdb]# 
[root@mysqlserver posdb]# cat employees.CSV
1001,"Ranga","2024-05-17"
1002,"Manga","2024-05-17"
1003,"Changa","2024-05-17"
1004,"Sunga","2024-05-17"
[root@mysqlserver posdb]# 


mysql> select * from employees;
+--------+----------+------------+
| emp_id | emp_name | emp_dob    |
+--------+----------+------------+
|   1001 | Ranga    | 2024-05-17 |
|   1002 | Manga    | 2024-05-17 |
|   1003 | Changa   | 2024-05-17 |
+--------+----------+------------+

mysql> flush tables;
Query OK, 0 rows affected (0.01 sec)

mysql> select * from employees;
+--------+----------+------------+
| emp_id | emp_name | emp_dob    |
+--------+----------+------------+
|   1001 | Ranga    | 2024-05-17 |
|   1002 | Manga    | 2024-05-17 |
|   1003 | Changa   | 2024-05-17 |
|   1004 | Sunga    | 2024-05-17 |
+--------+----------+------------+


mysql> \! ls -rtl *employees*
-rw-r-----. 1 mysql mysql 3752 May 17 23:08 employees_394.sdi
-rw-r-----. 1 mysql mysql  105 May 17 23:17 employees.CSV
-rw-r-----. 1 mysql mysql   35 May 17 23:18 employees.CSM

mysql> alter table employees add primary key ( emp_id );
ERROR 1069 (42000): Too many keys specified; max 0 keys allowed
mysql> 

mysql> create index idx_employees_empname on employees ( emp_name );
ERROR 1069 (42000): Too many keys specified; max 0 keys allowed
mysql> 

mysql> start transaction;
Query OK, 0 rows affected (0.00 sec)

mysql> delete from employees where emp_id = 1004;
Query OK, 1 row affected (0.09 sec)

mysql> rollback;
Query OK, 0 rows affected, 1 warning (0.00 sec)

mysql> show warnings;
+---------+------+---------------------------------------------------------------+
| Level   | Code | Message                                                       |
+---------+------+---------------------------------------------------------------+
| Warning | 1196 | Some non-transactional changed tables couldn't be rolled back |
+---------+------+---------------------------------------------------------------+
1 row in set (0.01 sec)

mysql> select * from employees;
+--------+----------+------------+
| emp_id | emp_name | emp_dob    |
+--------+----------+------------+
|   1001 | Ranga    | 2024-05-17 |
|   1002 | Manga    | 2024-05-17 |
|   1003 | Changa   | 2024-05-17 |
+--------+----------+------------+
3 rows in set (0.00 sec)

In [ ]:
MyISAM storage engine 
==========================

-- My + ISAM - Indexed Sequence Access Method.
-- indexing algorithm developed by IBM used in faster retreival of large sets of data.
-- does not support transactions.

mysql> create table emp_details (
    -> emp_id int primary key,
    -> emp_name varchar(100),
    -> emp_dob date
    -> ) engine = myisam;

Query OK, 0 rows affected (0.01 sec)


mysql> insert into emp_details values
    -> (1001,'Ranga',now()),
    -> (1002,'Manga',now()),
    -> (1003,'Changa',now()
    -> );

Query OK, 3 rows affected, 3 warnings (0.00 sec)
Records: 3  Duplicates: 0  Warnings: 3

mysql> \! ls -rtl
total 12
-rw-r-----. 1 mysql mysql 3561 May 17 23:27 emp_details_395.sdi
-rw-r-----. 1 mysql mysql   60 May 17 23:28 emp_details.MYD
-rw-r-----. 1 mysql mysql 2048 May 17 23:28 emp_details.MYI
mysql> 

mysql> create index idx_emp_details_emp_name on emp_details ( emp_name );
Query OK, 3 rows affected (0.23 sec)
Records: 3  Duplicates: 0  Warnings: 0

mysql> start transaction;
Query OK, 0 rows affected (0.00 sec)

mysql> insert into emp_details values (1004,'Sunga',now());
Query OK, 1 row affected, 1 warning (0.01 sec)

mysql> rollback;
Query OK, 0 rows affected, 1 warning (0.00 sec)

mysql> show warnings;
+---------+------+---------------------------------------------------------------+
| Level   | Code | Message                                                       |
+---------+------+---------------------------------------------------------------+
| Warning | 1196 | Some non-transactional changed tables couldn't be rolled back |
+---------+------+---------------------------------------------------------------+
1 row in set (0.00 sec)

mysql> select * from emp_details;
+--------+----------+------------+
| emp_id | emp_name | emp_dob    |
+--------+----------+------------+
|   1001 | Ranga    | 2024-05-17 |
|   1002 | Manga    | 2024-05-17 |
|   1003 | Changa   | 2024-05-17 |
|   1004 | Sunga    | 2024-05-17 |
+--------+----------+------------+
4 rows in set (0.00 sec)

In [ ]:
Archive storage engine
====================================

-- stores table data in compressed format , .ARZ file.
-- uses gzip to compress rows.
-- No partitioning , No delete or update operation.
-- No index support.


mysql> create table emp_details ( 
    emp_id int primary key, 
    emp_name varchar(100), 
    emp_dob date ) engine = archive;

ERROR 1030 (HY000): Got error -1 - 'Unknown error -1' from storage engine

mysql> create table emp_details ( 
    emp_id int , 
    emp_name varchar(100), 
    emp_dob date ) engine = archive;

Query OK, 0 rows affected (0.19 sec)

mysql> insert into emp_details values
    -> (1001,'Ranga',now()),
    -> (1002,'Changa',now()),
    -> (1003,'Manga',now());

Query OK, 3 rows affected, 3 warnings (0.00 sec)
Records: 3  Duplicates: 0  Warnings: 3

mysql> \! ls -rtl
total 8
-rw-r-----. 1 mysql mysql 3193 May 17 23:37 emp_details_399.sdi
-rw-r-----. 1 mysql mysql   88 May 17 23:37 emp_details.ARZ


mysql> update emp_details set emp_name = 'Sunga' where emp_id = 1002;
ERROR 1031 (HY000): Table storage engine for 'emp_details' doesn't have this option
mysql> 

mysql> delete from emp_details where emp_id = 1003;
ERROR 1031 (HY000): Table storage engine for 'emp_details' doesn't have this option
mysql> 


mysql> start transaction;
Query OK, 0 rows affected (0.00 sec)

mysql> insert into emp_details values (1004,'Sunga',now());
Query OK, 1 row affected, 1 warning (0.00 sec)

mysql> rollback;
Query OK, 0 rows affected, 1 warning (0.00 sec)

mysql> show warnings;
+---------+------+---------------------------------------------------------------+
| Level   | Code | Message                                                       |
+---------+------+---------------------------------------------------------------+
| Warning | 1196 | Some non-transactional changed tables couldn't be rolled back |
+---------+------+---------------------------------------------------------------+
1 row in set (0.00 sec)

mysql> select * from emp_details;
+--------+----------+------------+
| emp_id | emp_name | emp_dob    |
+--------+----------+------------+
|   1001 | Ranga    | 2024-05-17 |
|   1002 | Changa   | 2024-05-17 |
|   1003 | Manga    | 2024-05-17 |
|   1004 | Sunga    | 2024-05-17 |
+--------+----------+------------+
4 rows in set (0.00 sec)

In [ ]:
Innodb storage engine 
===============================

-- default storage engine , ACID complaint.
-- supports row level locking , indexing and transactions.
-- best for OLTP.

mysql> create table emp_details (
    -> emp_id int primary key,
    -> emp_name varchar(100),
    -> emp_dob date
    -> ) engine = innodb;

Query OK, 0 rows affected (0.03 sec)

mysql> insert into emp_details values 
    -> (1001,'Ranga',now()),
    -> (1002,'Changa',now()),
    -> (1003,'Manga',now());

Query OK, 3 rows affected, 3 warnings (0.00 sec)
Records: 3  Duplicates: 0  Warnings: 3

mysql> \! ls -rtl
total 112
-rw-r-----. 1 mysql mysql 114688 May 17 23:49 emp_details.ibd
mysql> 

mysql> start transaction;
Query OK, 0 rows affected (0.00 sec)

mysql> insert into emp_details values (1004,'Sunga',now());
Query OK, 1 row affected, 1 warning (0.00 sec)

mysql> rollback;
Query OK, 0 rows affected (0.00 sec)

mysql> select * from emp_details;
+--------+----------+------------+
| emp_id | emp_name | emp_dob    |
+--------+----------+------------+
|   1001 | Ranga    | 2024-05-17 |
|   1002 | Changa   | 2024-05-17 |
|   1003 | Manga    | 2024-05-17 |
+--------+----------+------------+
3 rows in set (0.01 sec)

In [ ]:
Innodb Architecture 
==========================================

In-Memory structures - Buffer pool , Change buffer , Adaptive Hash Index , Log buffer.

On-Disk structures - Tables , Indexes , Tablespaces , Double write buffer , redo logs , undo logs.


In-Memory structures
=======================================


Buffer Pool -- is the main memory area where innodb caches table and index data as it is accessed.
            -- this memory area allows direct access to data which speeds up processing.
            -- on dedicated servers , upto 80% memory is oftern assigned to the buffer pool.

            -- buffer pool uses LRU ( Least recently used) algorithm to evict data to store new data.
            -- buffer pool is manged as a list and divided into 2, top new sublist and bottom old sublist.
            -- new data is inserted in the middle with midpoint insertion stratergy.
            -- accessing the data in old sublist makes it young and moves it to head of new sublist.

mysql> show variables like '%innodb_buffer%';
+-------------------------------------+----------------+
| Variable_name                       | Value          |
+-------------------------------------+----------------+
| innodb_buffer_pool_chunk_size       | 134217728      |
| innodb_buffer_pool_filename         | ib_buffer_pool |
| innodb_buffer_pool_instances        | 1              |
| innodb_buffer_pool_size             | 134217728      |
+-------------------------------------+----------------+

On 64-bit systems with sufficient memory , buffer pool can be split into multiple parts to minimize contention 

innodb_buffer_pool_size = innodb_buffer_pool_chunk_size * innodb_buffer_pool_instances

innodb-buffer-pool-chunk-size                                134217728
innodb-buffer-pool-instances                                 0
innodb-buffer-pool-size                                      134217728



Change Buffer   -- is a special data structure that caches secondary indexes.
                -- when there is insert,update and delete opeartions , the table and clustered index data
                   is cached into buffer pool but the secondary index data is cached into change buffer to
                   avoid excessive i/o.
                -- change buffer is part of buffer pool.

                -- change buffering is most valuable for workloads that are i/o bound. ( high volums of DML ).

                -- change buffering can be enabled/diabled.

                innodb-change-buffering      all (default) | none | inserts | delete | changes | purges

mysql> show variables like '%innodb_change_buffering%';
+-------------------------+-------+
| Variable_name           | Value |
+-------------------------+-------+
| innodb_change_buffering | all   |
+-------------------------+-------+


change buffer is allocated as percentage of buffer pool , max size default is 25 %

consider increasing this if there are heavy insert , update and delete activity.

consider decreasing if data is static used for reporting.

mysql> show variables like '%innodb_change_buffer%';
+-------------------------------+-------+
| Variable_name                 | Value |
+-------------------------------+-------+
| innodb_change_buffer_max_size | 25    |
+-------------------------------+-------+



Adaptive Hash Index -- innodb monitors queries and builds hash index if it sees it will speed up the execution.

mysql> show variables like '%innodb_adaptive%';
+----------------------------------+--------+
| Variable_name                    | Value  |
+----------------------------------+--------+
| innodb_adaptive_hash_index       | ON     |
| innodb_adaptive_hash_index_parts | 8      |
+----------------------------------+--------+


log buffer -- is the memory area which holds data to be written to log files on disk.
           -- default is 16 MB.
           -- if there are transactions with more inserts,updates and deletes increasing this will save disk i/o.

mysql> show variables like '%log_buffer%';
+------------------------+----------+
| Variable_name          | Value    |
+------------------------+----------+
| innodb_log_buffer_size | 16777216 |
+------------------------+----------+

In [ ]:

On-Disk structures
===============================


Doublewrite buffer -- is a storage area where the data is stored before flushing into data files.
                   -- so the name is double write , data is written to this buffer and file.

mysql> show variables like '%innodb_double%';
+-------------------------------+-------+
| Variable_name                 | Value |
+-------------------------------+-------+
| innodb_doublewrite            | ON    |
| innodb_doublewrite_batch_size | 0     |
| innodb_doublewrite_dir        |       |
| innodb_doublewrite_files      | 2     |
| innodb_doublewrite_pages      | 4     |
+-------------------------------+-------+
5 rows in set (0.01 sec)

[root@mysqlprod02 ~]# ls -rtl /var/lib/mysql/ | grep dblwr
-rw-r-----. 1 mysql mysql   8978432 Jun  4 12:50 #ib_16384_1.dblwr
-rw-r-----. 1 mysql mysql    589824 Jun  4 15:16 #ib_16384_0.dblwr
[root@mysqlprod02 ~]# 


Redo Log -- is a file where the changes to the database are recorded.
         -- its is used during crash recovery.
         -- the contents of log buffer is flushed into this redo log file.

         -- it is stored inside #innodb_redo directory with 32 files.
         -- the size of the files is specified using innodb_redo_log_capacity.
         -- 21 active and 11 spare redo logs , spare are suffixed by _tmp.

mysql> show variables like '%innodb_redo%';
+------------------------------+-----------+
| Variable_name                | Value     |
+------------------------------+-----------+
| innodb_redo_log_archive_dirs |           |
| innodb_redo_log_capacity     | 536870912 |
+------------------------------+-----------+

mysql> show variables like '%innodb_log%';
+------------------------------------+----------+
| Variable_name                      | Value    |
+------------------------------------+----------+
| innodb_log_file_size               | 50331648 |
| innodb_log_files_in_group          | 2        |
| innodb_log_group_home_dir          | ./       |
+------------------------------------+----------+

[root@mysqlprod02 ~]# ls -rtl /var/lib/mysql/#innodb_redo/
total 524288
-rw-r-----. 1 mysql mysql 16777216 Jun  4 23:16 '#ib_redo3_tmp'
-rw-r-----. 1 mysql mysql 16777216 Jun  4 23:16 '#ib_redo4_tmp'
-rw-r-----. 1 mysql mysql 16777216 Jun  4 23:16 '#ib_redo5_tmp'
-rw-r-----. 1 mysql mysql 16777216 Jun  4 23:16 '#ib_redo6_tmp'
-rw-r-----. 1 mysql mysql 16777216 Jun  4 23:18 '#ib_redo2'

[root@mysqlprod02 ~]# ls -rtl /var/lib/mysql/#innodb_redo/ | grep -v total | wc -l
32
[root@mysqlprod02 ~]# 

mysql> select * from performance_schema.innodb_redo_log_files;
+---------+--------------------------+------------+------------+---------------+---------+----------------+
| FILE_ID | FILE_NAME                | START_LSN  | END_LSN    | SIZE_IN_BYTES | IS_FULL | CONSUMER_LEVEL |
+---------+--------------------------+------------+------------+---------------+---------+----------------+
|       2 | ./#innodb_redo/#ib_redo2 | 2996553728 | 3013328896 |      16777216 |       0 |              0 |
+---------+--------------------------+------------+------------+---------------+---------+----------------+
1 row in set (0.00 sec)



Undo log -- record contains information about how to undo the latest change by a transaction.
         -- if another transaction needs the original data as part of consistent reads the unmodified data
             is retreived from the undo log.

         -- undo records are stored inside rollback segments.
         -- There are 2 types of undo records - undo records of normal tables , undo records of temporary tables.
         -- undo records of normal tables reside in undo tablespaces.
         -- undo records of temporary tables reside in global temporary tablespace.
         -- both undo tablespace and global temporary tablespace support a maximum of 128 rollback segments.

mysql> show variables like '%innodb_undo%';
+--------------------------+-------+
| Variable_name            | Value |
+--------------------------+-------+
| innodb_undo_directory    | ./    |
| innodb_undo_tablespaces  | 2     |
+--------------------------+-------+

ls -rtl /var/lib/mysql/*undo*
-rw-r-----. 1 mysql mysql 50331648 Jun  4 23:18 /var/lib/mysql/undo_001
-rw-r-----. 1 mysql mysql 33554432 Jun  4 23:18 /var/lib/mysql/undo_002

In [ ]:

Creating tables externally 
=========================================

        -- Tables can be created outside the data_directory for space management , I/O optimization , etc.

[root@mysqlprod02 lib]# mkdir -p /var/lib/invoicedata
[root@mysqlprod02 lib]# 
[root@mysqlprod02 lib]# chown -R mysql:mysql /var/lib/invoicedata
[root@mysqlprod02 lib]# 

mysql> create table invoices ( inv_id int primary key , inv_desc varchar(100) , inv_date datetime )
    -> data directory = '/var/lib/invoicedata';
ERROR 3121 (HY000): The DATA DIRECTORY location must be in a known directory.
mysql> 

known directory are those defined by  datadir , innodb_data_home_dir , innodb_directories

[root@mysqlprod02 ~]# vi /etc/my.cnf
[root@mysqlprod02 lib]# cat /etc/my.cnf | grep innodb-dir
innodb-directories = /var/lib/invoicedata
[root@mysqlprod02 ~]# mysqld --validate-config
[root@mysqlprod02 ~]# systemctl restart mysqld


mysql> create table invoices ( inv_id int primary key , inv_desc varchar(100) , inv_date datetime )
    -> data directory = '/var/lib/invoicedata';
Query OK, 0 rows affected (0.03 sec)

mysql> \! ls -rtl /var/lib/invoicedata/salesdb/
total 112
-rw-r-----. 1 mysql mysql 114688 Jun  5 02:13 invoices.ibd
mysql> 


[root@mysqlprod02 lib]# cat /etc/my.cnf | grep innodb-dir
innodb-directories = /var/lib/invoicedata;/opt/mysql/invoicedata
[root@mysqlprod02 lib]# 

mysql> create table oldinvoices ( inv_id int primary key , inv_desc varchar(100) , inv_date datetime ) 
       data directory = '/opt/mysql/invoicedata';
ERROR 1030 (HY000): Got error 168 - 'Unknown (generic) error from engine' from storage engine

mysql> create table oldinvoices ( inv_id int primary key , inv_desc varchar(100) , inv_date datetime ) 
       data directory = '/var/lib/invoicedata';
Query OK, 0 rows affected (0.03 sec)


[root@mysqlprod02 lib]# sestatus
SELinux status:                 enabled
SELinuxfs mount:                /sys/fs/selinux
SELinux root directory:         /etc/selinux
Loaded policy name:             targeted
Current mode:                   enforcing  ===========
Mode from config file:          enforcing
Policy MLS status:              enabled
Policy deny_unknown status:     allowed
Memory protection checking:     actual (secure)
Max kernel policy version:      33
[root@mysqlprod02 lib]# 

[root@mysqlprod02 lib]# setenforce 0
[root@mysqlprod02 lib]# 

[root@mysqlprod02 lib]# sestatus
SELinux status:                 enabled
SELinuxfs mount:                /sys/fs/selinux
SELinux root directory:         /etc/selinux
Loaded policy name:             targeted
Current mode:                   permissive ==============
Mode from config file:          enforcing
Policy MLS status:              enabled
Policy deny_unknown status:     allowed
Memory protection checking:     actual (secure)
Max kernel policy version:      33
[root@mysqlprod02 lib]# 


mysql> create table newinvoices ( inv_id int primary key , inv_desc varchar(100) , inv_date datetime ) 
       data directory = '/opt/mysql/invoicedata';
Query OK, 0 rows affected (0.02 sec)

mysql> \! ls -rtl /opt/mysql/invoicedata/salesdb/
total 112
-rw-r-----. 1 mysql mysql 114688 Jun  5 02:23 newinvoices.ibd
mysql>

In [ ]:
Importing Innodb tables ( Transportable Tablespace)
===============================================================

Transportable Tablespace is a feature where a table can be imported by copying physical files.


1. on destination instance , create a table with same definition as the original table.

mysql> use loadtestdb;
Database changed
mysql> show create table loadtesttable;

mysql> use ordersdb;
Database changed
mysql> CREATE TABLE `loadtesttable` (
    ->   `ID` int NOT NULL AUTO_INCREMENT,
    ->   `Name` varchar(255) DEFAULT NULL,
    ->   `Age` int DEFAULT NULL,
    ->   `Salary` decimal(10,2) DEFAULT NULL,
    ->   `Department` varchar(50) DEFAULT NULL,
    ->   `City` varchar(100) DEFAULT NULL,
    ->   `Country` varchar(100) DEFAULT NULL,
    ->   PRIMARY KEY (`ID`)
    -> ) ENGINE=InnoDB;
Query OK, 0 rows affected (0.03 sec)


2. on destination instance , discard the tablespace of the table just created.

mysql> alter table loadtesttable discard tablespace;
Query OK, 0 rows affected (0.01 sec)


3. on source instance , flush table for import. only read-only transactions are allowed on this table now.

mysql> flush table loadtesttable for export;
Query OK, 0 rows affected (0.00 sec)

mysql> \! ls -rtl /var/lib/mysql/loadtestdb/
total 81924
-rw-r-----. 1 mysql mysql 83886080 Jun  3 23:01 loadtesttable.ibd
-rw-r-----. 1 mysql mysql     1065 Jun  5 20:36 loadtesttable.cfg
mysql> 


4. copy the .ibd and .cfg files from source to destination.

[root@mysqlprod02 ~]# cp -p /var/lib/mysql/loadtestdb/* /var/lib/mysql/ordersdb/
[root@mysqlprod02 ~]# 
[root@mysqlprod02 ~]# ls -rtl /var/lib/mysql/ordersdb/load*
-rw-r-----. 1 mysql mysql 83886080 Jun  3 23:01 /var/lib/mysql/ordersdb/loadtesttable.ibd
-rw-r-----. 1 mysql mysql     1065 Jun  5 20:36 /var/lib/mysql/ordersdb/loadtesttable.cfg
[root@mysqlprod02 ~]# 


5. on source instance , use unlock table to release the lock acquired by flush table ( table goes into read-write).

mysql> unlock tables;
Query OK, 0 rows affected (0.00 sec)


6. on destination instance , import the tablespace.

mysql> use ordersdb;
Database changed
mysql> alter table loadtesttable import tablespace;
Query OK, 0 rows affected (1.89 sec)


7. check the source and destination table row count.

mysql> select count(*) from loadtestdb.loadtesttable;
+----------+
| count(*) |
+----------+
|  1000000 |
+----------+
1 row in set (1.53 sec)

mysql> select count(*) from ordersdb.loadtesttable;
+----------+
| count(*) |
+----------+
|  1000000 |
+----------+
1 row in set (0.05 sec)

In [ ]:
Tablespaces 
=========================

system tablespace -- is the storage area for change buffer & for tables and indexes which are not in file-per-table.
                  -- in earlier version data dictionary resided in system tablespace. now it is moved to mysql tablespace.
                  -- in earlier version double write buffer also resided in system tablespace.

                  -- by default ibdata1 data file is created for system tablespace in the data directory.

mysql> show variables like '%innodb_data%';
+-----------------------+------------------------------------+
| Variable_name         | Value                              |
+-----------------------+------------------------------------+
| innodb_data_file_path | ibdata1:12M;ibdata2:20M:autoextend |
| innodb_data_home_dir  |                                    |
+-----------------------+------------------------------------+
2 rows in set (0.00 sec)

mysql> \! ls -rtl /var/lib/mysql/ibdata*
-rw-r-----. 1 mysql mysql 20971520 May 22 22:20 /var/lib/mysql/ibdata2
-rw-r-----. 1 mysql mysql 12582912 Jun  5 20:40 /var/lib/mysql/ibdata1



file-per-table tablespace -- contains data and indexes of a single table on a single datafile.
                          -- for innodb this is the default.
                          -- disabling innodb_file_per_table will create tables in system tablespace.
                          -- an .idb datafile will be created inside schema directory.
                          -- for employeesdb schema with employee_details table ,  will have employee_details.ibd file 
                             in employeesdb directory.


mysql> show variables like '%file_per_table%';
+-----------------------+-------+
| Variable_name         | Value |
+-----------------------+-------+
| innodb_file_per_table | ON    |
+-----------------------+-------+
1 row in set (0.00 sec)

mysql> show tables in employeesdb;
+-----------------------+
| Tables_in_employeesdb |
+-----------------------+
| employee_details      |
| product_details       |
+-----------------------+
2 rows in set (0.00 sec)

mysql> \! ls -rtl /var/lib/mysql/employeesdb
total 9328
-rw-r-----. 1 mysql mysql  114688 Jun  1 02:15 employee_details.ibd
-rw-r-----. 1 mysql mysql 9437184 Jun  1 02:15 product_details.ibd

mysql> set global innodb_file_per_table = OFF;
Query OK, 0 rows affected (0.00 sec)

mysql> create table employee_salary ( emp_id int , emp_sal numeric(6,2) );
Query OK, 0 rows affected (0.25 sec)

mysql> \! ls -rtl /var/lib/mysql/employeesdb
total 9328
-rw-r-----. 1 mysql mysql  114688 Jun  1 02:15 employee_details.ibd
-rw-r-----. 1 mysql mysql 9437184 Jun  1 02:15 product_details.ibd
mysql> 

mysql> set global innodb_file_per_table = ON;
Query OK, 0 rows affected (0.00 sec)


Advantages of file-per-table 
        -- disk space is returned to the OS after truncating or dropping a table.
        -- tables can be created on a separate faster storage for i/o optimisation , space management.
        -- tables can be imported via transportable tablespaces which is faster than traditional mysqldump.
        -- tables can be backed up and restored quickly via hot backup tools



General Tablespace  -- is a shared tablespace where data of multiple tables can be stored.
                    -- can be created outside the data directory.


create tablespace inside data directory 
-------------------------------------------

mysql> create tablespace invoicedata;
Query OK, 0 rows affected (0.03 sec)

mysql> create tablespace salesdata add datafile 'salesdatafile.ibd';
Query OK, 0 rows affected (0.00 sec)

mysql> create table invoicetable1 (inv_id int , inv_name varchar(20)) tablespace invoicedata;
Query OK, 0 rows affected (0.01 sec)

mysql> create table invoicetable2 (inv_id int , inv_name varchar(20)) tablespace invoicedata;
Query OK, 0 rows affected (0.03 sec)

mysql> create table salestable1 (sales_id int , sale_name varchar(20)) tablespace salesdata;
Query OK, 0 rows affected (0.03 sec)

mysql> create table salestable2 (sales_id int , sale_name varchar(20)) tablespace salesdata;
Query OK, 0 rows affected (0.03 sec)


create tablespace outside data directory 
-------------------------------------------

mysql> show variables like '%innodb_dir%';
+--------------------+---------------------------------------------+
| Variable_name      | Value                                       |
+--------------------+---------------------------------------------+
| innodb_directories | /var/lib/invoicedata;/opt/mysql/invoicedata |
+--------------------+---------------------------------------------+
1 row in set (0.00 sec)

mysql> create tablespace invoicedata2024 add datafile '/var/lib/invoicedata/invoicedata2024.ibd';
Query OK, 0 rows affected (0.02 sec)


mysql> select * from information_schema.INNODB_TABLESPACES_BRIEF where name like '%invoicedata%';
+--------------+-----------------+------------------------------------------+--------------+------------+
| SPACE        | NAME            | PATH                                     | FLAG         | SPACE_TYPE |
+--------------+-----------------+------------------------------------------+--------------+------------+
| 0x383638     | invoicedata     | ebe92515-2360-11ef-9272-000c297f8903.ibd | 0x3138343332 | General    |
| 0x383730     | invoicedata2024 | /var/lib/invoicedata/invoicedata2024.ibd | 0x3138343332 | General    |
+--------------+-----------------+------------------------------------------+--------------+------------+
2 rows in set (0.00 sec)

mysql> select * from information_schema.INNODB_TABLESPACES_BRIEF where name like '%salesdata%';
+--------------+-----------+-------------------+--------------+------------+
| SPACE        | NAME      | PATH              | FLAG         | SPACE_TYPE |
+--------------+-----------+-------------------+--------------+------------+
| 0x383639     | salesdata | salesdatafile.ibd | 0x3138343332 | General    |
+--------------+-----------+-------------------+--------------+------------+
1 row in set (0.01 sec)



Undo Tablespace -- contains undo log which contains information about how to undo latest transaction.
                -- by default 2 undo tablespaces are created with each 16 MB.
                -- additional undo tablespace can be created if undo tablespace grows large.


mysql> show variables like '%innodb_undo%';
+--------------------------+-------+
| Variable_name            | Value |
+--------------------------+-------+
| innodb_undo_directory    | ./    |
| innodb_undo_log_encrypt  | OFF   |
| innodb_undo_log_truncate | ON    |
| innodb_undo_tablespaces  | 2     |
+--------------------------+-------+
4 rows in set (0.01 sec)

mysql> \! ls -rtl /var/lib/mysql/undo*
-rw-r-----. 1 mysql mysql 33554432 Jun  5 23:09 /var/lib/mysql/undo_002
-rw-r-----. 1 mysql mysql 50331648 Jun  5 23:11 /var/lib/mysql/undo_001
mysql> 

mysql> select * from information_schema.INNODB_TABLESPACES_BRIEF where name like '%undo%';
+------------------------+-----------------+------------+------------+------------+
| SPACE                  | NAME            | PATH       | FLAG       | SPACE_TYPE |
+------------------------+-----------------+------------+------------+------------+
| 0x34323934393637323739 | innodb_undo_001 | ./undo_001 | 0x30       | Single     |
| 0x34323934393637323738 | innodb_undo_002 | ./undo_002 | 0x30       | Single     |
+------------------------+-----------------+------------+------------+------------+
2 rows in set (0.00 sec)

mysql> select name , space_type , state from information_schema.INNODB_TABLESPACES 
       where name like '%undo%';
+-----------------+------------+--------+
| name            | space_type | state  |
+-----------------+------------+--------+
| innodb_undo_001 | Undo       | active |
| innodb_undo_002 | Undo       | active |
+-----------------+------------+--------+
2 rows in set (0.00 sec)


Adding undo tablespace 
-------------------------------

mysql> create undo tablespace undo_003  add datafile 'undo_003.ibu';
Query OK, 0 rows affected (0.37 sec)

mysql> create undo tablespace undo_004  add datafile 'undo_004.ibu';
Query OK, 0 rows affected (0.15 sec)

mysql> select name , space_type , state from information_schema.INNODB_TABLESPACES where name like '%undo%';
+-----------------+------------+--------+
| name            | space_type | state  |
+-----------------+------------+--------+
| innodb_undo_001 | Undo       | active |
| innodb_undo_002 | Undo       | active |
| undo_003        | Undo       | active |
| undo_004        | Undo       | active |
+-----------------+------------+--------+
4 rows in set (0.00 sec)


Dropping Undo tablespace 
------------------------------------

mysql> drop undo tablespace undo_004;
ERROR 1529 (HY000): Failed to drop UNDO TABLESPACE undo_004
mysql> 
mysql> alter undo tablespace undo_004 set inactive;
Query OK, 0 rows affected (0.00 sec)

mysql> drop undo tablespace undo_004;
Query OK, 0 rows affected (0.01 sec)

mysql> select name , space_type , state from information_schema.INNODB_TABLESPACES where name like '%undo%';
+-----------------+------------+--------+
| name            | space_type | state  |
+-----------------+------------+--------+
| innodb_undo_001 | Undo       | active |
| innodb_undo_002 | Undo       | active |
| undo_003        | Undo       | active |
+-----------------+------------+--------+
3 rows in set (0.00 sec)


Truncating Undo tablespace
------------------------------------------

Automatic 
----------------

mysql> show variables like '%innodb_undo_log%';
+--------------------------+-------+
| Variable_name            | Value |
+--------------------------+-------+
| innodb_undo_log_truncate | ON    |
+--------------------------+-------+
2 rows in set (0.00 sec)


Manual 
---------------

mysql> \! ls -rtl /var/lib/mysql/undo*
-rw-r-----. 1 mysql mysql 16777216 Jun  5 23:37 /var/lib/mysql/undo_003.ibu
-rw-r-----. 1 mysql mysql 33554432 Jun  5 23:37 /var/lib/mysql/undo_002
-rw-r-----. 1 mysql mysql 50331648 Jun  5 23:37 /var/lib/mysql/undo_001
mysql> 

mysql> alter undo tablespace innodb_undo_001 set inactive;
Query OK, 0 rows affected (0.00 sec)

mysql> alter undo tablespace innodb_undo_001 set active;
\Query OK, 0 rows affected (0.06 sec)

mysql> alter undo tablespace innodb_undo_002 set inactive;
Query OK, 0 rows affected (0.00 sec)

mysql> alter undo tablespace innodb_undo_002 set active;
Query OK, 0 rows affected (0.00 sec)

mysql> \! ls -rtl /var/lib/mysql/undo*
-rw-r-----. 1 mysql mysql 16777216 Jun  5 23:40 /var/lib/mysql/undo_003.ibu
-rw-r-----. 1 mysql mysql 16777216 Jun  5 23:40 /var/lib/mysql/undo_001
-rw-r-----. 1 mysql mysql 16777216 Jun  5 23:40 /var/lib/mysql/undo_002
mysql>